"""
2. Во втором массиве сохранить индексы чётных элементов первого
массива. Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то
во второй массив надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 -
если индексация начинается с нуля), т.к. именно в этих позициях первого
массива стоят чётные числа.
"""

import random

size = 10
min_item = 0
max_item = 100
out_index = []
array = [random.randint(min_item, max_item) for _ in range(size)]
print(f'Первый массив {array}')
for i in array:
    if i % 2 == 0:
        out_index.append(array.index(i))

print(f'Индексы чётных элементов первого массива: {out_index}')
