"""
Пользователь вводит номер буквы в алфавите. Определить, какая это буква
https://drive.google.com/file/d/1AWODciQ8VOinjZaI7TDYIg6Sf018-ib2/view?usp=sharing
"""

a = int(input('Введите номер буквы латинского алфавита(от 1 до 26): '))
tot = chr(a+96)
print(f'Это буква: {tot}')


