"""
Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят и сколько между ними находится букв
"""


a = input('Введите первую букву латинского алфавита(от 1 до 26): ')
b = input('Введите вторую букву латинского алфавита(от 1 до 26): ')

tot = ord(a) - ord(b) + 1
num1 = ord(a) - 96
num2 = ord(b) - 96
print(f'Между {a} и {b}  {tot} букв(ы)')
print(f' {a} находится на {num1} месте, а  {b} на {num2} месте алфавита')
