"""
В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать не более чем за 10 попыток.
После каждой неудачной попытки должно сообщаться, больше или меньше введенное пользователем число, чем то, что загадано.
Если за 10 попыток число не отгадано, вывести правильный ответ.
"""

from random import randint

x = 0
a = randint(1, 100)

b = int(input('Введите число от 1 до 100: '))


def rand_num(a,b,x=0):
    if b == a and x <= 10:
        return print('Вы угадали!')
    if b < a:
        print(print("Загаданное число больше!"))
        b = int(input('Введите число от 1 до 100: '))
        return rand_num(b, x + 1)
    if b > a:
        print("Загаданное число меньше!")
        b = int(input('Введите число от 1 до 100: '))
        return rand_num(b, x + 1)
    print(f'Осталось {10 - x} попыток')


rand_num(a, b)
print('Это число: ' + str(a))

# while x < 10:
#     b = int(input('Введите число от 1 до 100: '))
#     if b > a:
#         print("Загаданное число меньше!")
#     elif b < a:
#         print('Загаданное число больше!')
#     elif b == a:
#         print('Вы угадали!')
#         break
#     x += 1
#     print(f'Осталось {10 - x} попыток')
# print('Это число: ' + str(a))
